app/controllers/fivelets_controller.rb

def create
	if user_signed_in? == true

		@fivelet = current_user.fivelets.build(fivelet_params)

	else
		@fivelet = Fivelet.new(fivelet_params)
	end
	if @fivelet.save
---
INSERT INTO "fivelets" ("created_at", "updated_at", "artist1", "artist2", "artist3", "artist4", "artist5") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", 2016-12-04 12:13:05 UTC], ["updated_at", 2016-12-04 12:13:05 UTC], ["artist1", "12"], ["artist2", "3"], ["artist3", "4"], ["artist4", "5"], ["artist5", "6"]]

def show
	@fivelet = Fivelet.find(params[:id])
---
SELECT  "fivelets".* FROM "fivelets" WHERE "fivelets"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]